import React, {useState} from 'react';
import {Dialog, Title, Footnote, FooterButton, Content} from './dialog'

function Dody() {
  const [dialogIsOpen, handleDialog] = useState(false);
  return (
    <>
      <Dialog
        closeDialog={() => handleDialog(false)} 
        dialogIsOpen={dialogIsOpen}
        size="m" // xl, l, m, s 
        padding={3} // num 단위: rem
        >
        <Title>타이틀입니다 이 다이얼로그의 제목이기도 하지요</Title>
        <Footnote>혹시나 해서 타이틀 밑에도 주석을 넣을 수 있습니다</Footnote>
        <Content>
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요콘텐츠 입니다 관련된 콘텐츠를 작성해주세요
          </Content>
        <FooterButton
          buttonPosition // 취소 버튼의 위치
          buttonType
          buttonStyle // 닫기 모양 스타일, 사각형 모양 버튼, cancelButton
          closeDialog={() => handleDialog(false)} // 값 전달을 좀더 효율적으로 해야 함.
          >
          확인하기
        </FooterButton>
      </Dialog>

      <button onClick={() => handleDialog(true)}>열려라</button>
    </>
  );
};

export default Dody;